const techProblemsMessage = {
    "ru": "Извините, возникли какие-то технические неполадки🥲 Скоро мы всё восстановим.\n\nПопробуйте нажать кнопку в ⬆️предыдущем сообщении⬆️ повторно, если проблема осталась, можете написать нам\n\n@hulio_zas - тех. поддержка\n\n@azhypa - автор курса"
}

const welcomeMessage = {
    "ru": "Проблема художников 21 века - для них софт важнее художественных знаний.\n\nВ итоге блендер знают все, а круто делают - единицы.\n\nЧтобы стоить дорого - нужно уметь строить дорогую картинку - это факт ребята"
}

const prePaymentVideoAdvMessage = {
    "ru": "https://youtu.be/4m0slWtIRC0\n\nИммерсивный визуал - это профессиональный подход к созданию визуала.\n\nПодробнее тут"
}

const ratesDescriptionWithVideoMessage = {
    "ru": "Смотри, есть 3️⃣ тарифа.\n\n🟢BASIC - секреты дорогой картинки, система и формулы для ее построения.\n\n🟡ADVANCED - все то же + применение системы на дорогущих проекта (бюджеты на продакшен $15-25к).\n\n🔴PRO - содержит еще и мою личную консультацию по цене банки кофе."
}

const authorInfoWithPicMessage = {
    "ru": "Я Семен Ажипа - арт-директор, режиссер и Unreal Engine художник.\n\n✅Учился, работал и преподавал в креативном агентстве WARGAMING c 18-ти лет.\n\n✅Срежиссировал, смонтировал и супервайзил более 100 коммерческих видео-роликов.\n\n✅В портфолио кейсы с Arnold Scharcnagger, Chuck Norris, Sabaton, The Offspring, и т.д."
}

const authorInfoWithoutPicMessage = {
    "ru": "Программа ИММЕРСИВНЫЙ ВИЗУАЛ - решение большой проблемы индустрии, которую я наблюдал годами - непонимание художников, как строить красивый, вовлекающий визуал.\n\nЗа 58 минут она дает понимание, как профессионально подходить к этому вопросу и не допускать ошибок, из-за которых ты не можешь работать на серьезных коммерческих проектах."
}

const needHelpChoosingRateMessage = {
    "ru": "Нужна помощь в выборе тарифов❓\n\nНапиши мне в лс @azhypa\n\nИли можешь зайти на лендинг и посмотреть мои работы\nhttps://azhypa.com/mediacenter/main/portfolio"
}

const paymentLinkMessage = {
    "ru": 'Твоя ссылка на оплату доступа к WorkShop, жми на кнопку внизу сообщения\n\nПосле оплаты вернись сюда и нажми кнопку "Получить доступ🔑"⬇️⬇️⬇️\n\n'
}

const paymentIssuesMessage = {
    "ru": "Хеллоу. Ты планировал учиться создавать дорогой, вовлекающий визуал, помнишь❓\n\nОпять отложил до лучших времен❓\n\nИли возможно, дело в другом❓ Может, ты меня мало знаешь или вообще не знаешь❓\n\nПоделись\n\nЕсли хоешь, можешь зайти на лендинг и взглянуть на мои работы\nhttps://azhypa.com/mediacenter/main/portfolio"
}

const needHelpMessage = {
    "ru": "Пиши мне сразу в личку если че❗️ \n\n@azhypa\n\nТакже можешь зацти на мой лендинг, чтобы ознакомиться с моими работами\nhttps://azhypa.com/mediacenter/main/portfolio"
}

const noPaymentFinalMessage = {
    "ru": "Не теряйся, можешь мне в личку написать по всем вопросам:⬇️⬇️⬇️\n\n@azhypa"
}

const firstLessonVideoIntroMessage = {
    "ru": "Смотри первый урок, выполняй задание и переваривай информацию.\n\nПлан такой:\n\n✅Разберемся, что за эффект, который заставляет визуалы работать.\n\n✅Как человечество гонялось за этим эффектом 40 000 лет.\n\n✅Как его адаптируют великие художники, а мы этого не замечаем.\n\n✅Как научиться замечать.\n\n✅Основная миссия художника ( всегда держи в голове, чтобы делать круто)"
}

const firstLessonTestStartMessage = {
    "ru": "Теперь давай убедимся, что ты все понял из первой части. Это супер важно, на это я буду опираться дальше.\n\nПройди небольшой тест🤓. Ошибки не допускаются❌. У тебя 3 попытки.\n\nОтветишь правильно - перейдем к следующему уроку."
}

const secondLessonVideoIntroMessage = {
    "ru": "Движемся дальше Второй урок покажет:\n\n✅Как достичь эффекта Иммерсив, который умеют делать единицы.\n\n✅3 приёма для создания невероятной картинки.\n\n✅Как собрать их в формулу.\n\n✅Как с их помощью генерировать 1 000 000 вариантов решения одной и той же задачи.\n\n✅Как двигаться в творческих поисках, чтобы всегда получать крутой осознанный результат."
}

const secondLessonTestStartMessage = {
    "ru": "Как обычно - тест🤓.\n\nДавай убедимся, что мы на одной волне.\n\nА потом я расскажу, как при помощи формулы Продвинутого визуала менять свою ЖИЗНЬ.\n\n(это звучит очень колхозно, но это правда)\n\n(продвинутого, иммерсивного визуала, можно и так и так сказать блин)"
}

const thirdLessonProAdvancedIntroMessage = {
    "ru": "Супер❕ \n\nТретий, самый интересный урок - реальные кейсы❕ Что узнаешь: \n\n✅Как адаптировать знания иммерсивного визуала под каждый день своей жизни.\n\n✅Как делать абсолютную красоту из того, что находится под рукой.\n\n✅Какая главная идея позволяет получать результат в любых условиях.\n\n✅Как иммерсивные законы делают каждый проект top-notch качества."
}

const thirdLessonBasicIntroMessage = {
    "ru": "Супер❕\n\nТретий, самый интересный урок - реальные кейсы❕ Что узнаешь:\n\n✅Как адаптировать знания иммерсивного визуала под каждый день своей жизни.\n\n✅Как делать абсолютную красоту из того, что находится под рукой.\n\n✅Какая главная идея позволяет получать результат в любых условиях."
}

const signUpForSessionIntroMessage = {
    "ru": "Вот мы и подобрались к самому интересному. Смотр твоих проектов и вопросов 1 на 1 со мной.\n\nЧтобы записаться на эту сессию, ответь на 5 вопросов"
}

const proAdvancedFinalMessage = {
    "ru": "📝📝📝\n\nСпасибо, ответы приняты, скоро я с тобой свяжусь. Если не трудно, удели 2 минуты своего времени для прохождения опроса\nhttps://docs.google.com/forms/d/e/1FAIpQLSc99tmjhgOEO35E55RFbtDp0qEPImMqB4DMChIFYp6aP-D46A/viewform\n\nДо связи."
}

const advancedUpgradeOfferMessage = {
    "ru": "Итак, специальное предложение.\n\nПоскольку ты приобрел версию мастеркласса ADVANCED,  сейчас у тебя есть возможность апгрейднуться до PRO и попасть на стратегическую сессию 1-на-1  со мной всего за $20.\n\nОбсудим твои проекты, твою персональную стратегию роста и может быть, что-то еще :)\n\nЭто предложение одного дня. Завтра оно сгорает. Так шо думай и решай.\n\nЕсли интересно, вот тебе ссылка: \n\nhttps://mel.store/azhypa/27004"
}

const advancedUpgradeNoPaymentMessage = {
    "ru": "Напоминание: предложение попасть на стратегическую сессию 1-на-1 со мной сгорает через 1 час‼️\n\nВдруг ты забыл, вот ссылка:\n\nhttps://mel.store/azhypa/27004"
}

const advancedUpgradeNoPaymentFinalMessage = {
    "ru": "Окей, ты принял решение двигаться самостоятельно.\n\nТогда поздравляю с прохождением мастеркласса, не забывай внедрять формулу и не переставай учиться❕\n\nДо скорого."
}

const advancedUpgradeSuccessPaymentMessage = {
    "ru": "Вижу оплату. Ты повышен до PRO, теперь давай делать смотр твоих проектов и вопросов 1 на 1 со мной.\n\nЧтобы записаться на эту сессию, ответь на 5 вопросов"
}

const basicUpgradeOfferMessage = {
    "ru": "Итак, специальное предложение.\n\nПоскольку ты приобрел версию мастеркласса BASIC, я предлагаю тебе 2 апгрейда.\n\nДо ADVANCED за $30 - ты получишь +1 урок, с более углубленным материалом и разбором реальных коммерческих проектов.\n\nА апгрейд до PRO за $50 даст тебе возможность не только получить +1 урок с разбором коммерческих проектов, но и стратегическую сессию, созвон 1-на-1 со мной.\n\nОбсудим твои проекты, твою персональную стратегию роста и может быть, что-то еще :)\n\nЭто предложение одного дня. Завтра оно сгорает. Так шо думай и решай.\n\nЕсли интересно, нажимай на кнопки ниже"
}

const basicUpgradeToAdvancedPaymentLinkMessage = {
    "ru": "Вот твоя ссылка для оплаты. Потом возвращайся сюда и продолжай❕\n⬇️⬇️⬇️\n\nhttps://mel.store/azhypa/27008"
}

const basicUpgradeToProPaymentLinkMessage = {
    "ru": "Вот твоя ссылка для оплаты Потом возвращайся сюда и продолжай❕\n⬇️⬇️⬇️\n\nhttps://mel.store/azhypa/27010"
}

const basicUpgradeToAdvancedLessonFourIntroMessage = {
    "ru": "Вижу оплату. Ты повышен до ADVANCED\n\nЧетвертый, самый инсайдерский урок, - реальные кейсы❕ Что узнаешь:\n\n✅Как  применять иммерсивные законы от кадра к кадру, чтобы это работало. (поменять местами)\n\n✅Какая главная идея позволяет получать результат в любых условиях (коммерческий продукт).\n\n✅Как иммерсивные законы делают каждый проект top-notch качества."
}

const basicUpgradeToProLessonFourIntroMessage = {
    "ru": "Вижу оплату.\n\nТы повышен до PRO Четвертый, самый инсайдерский урок, - реальные кейсы❕ Что узнаешь:\n\n✅Как применять иммерсивные законы от кадра к кадру, чтобы это работало. (поменять местами)\n\n✅Какая главная идея позволяет получать результат в любых условиях (коммерческий продукт).\n\n✅Как иммерсивные законы делают каждый проект top-notch качества."
}

const basicUpgradeToAdvancedFinalMessage = {
    "ru": "Поздравляю с окончанием курса.\n\nЕсли остались вопросы, можешь мне писать.\nЕсли не сложно, удели пару минут на прохождение опроса\nhttps://docs.google.com/forms/d/e/1FAIpQLSc99tmjhgOEO35E55RFbtDp0qEPImMqB4DMChIFYp6aP-D46A/viewform \n\nСпасибо❕"
}








module.exports = {
    techProblemsMessage,
    welcomeMessage,
    prePaymentVideoAdvMessage,
    ratesDescriptionWithVideoMessage,
    authorInfoWithPicMessage,
    authorInfoWithoutPicMessage,
    needHelpChoosingRateMessage,
    paymentLinkMessage,
    paymentIssuesMessage,
    needHelpMessage,
    noPaymentFinalMessage,
    firstLessonVideoIntroMessage,
    firstLessonTestStartMessage,
    secondLessonVideoIntroMessage,
    secondLessonTestStartMessage,
    thirdLessonBasicIntroMessage,
    thirdLessonProAdvancedIntroMessage,
    signUpForSessionIntroMessage,
    proAdvancedFinalMessage,
    advancedUpgradeOfferMessage,
    advancedUpgradeNoPaymentMessage,
    advancedUpgradeNoPaymentFinalMessage,
    advancedUpgradeSuccessPaymentMessage,
    basicUpgradeOfferMessage,
    basicUpgradeToAdvancedPaymentLinkMessage,
    basicUpgradeToProPaymentLinkMessage,
    basicUpgradeToAdvancedLessonFourIntroMessage,
    basicUpgradeToProLessonFourIntroMessage,
    basicUpgradeToAdvancedFinalMessage
}